[Fight X2UniversalSoldierClassInfo]
ClassSpecializationTitle="战斗建筑师"
ClassSpecializationSummary="建筑师是机动性强但攻击能力较弱的特工，他们通过强大的尖塔来支援队友。这些不可移动的结构提供了强大的支持效果 - 如果建筑师将它们放置得当。"

[Flight X2UniversalSoldierClassInfo]
ClassSpecializationTitle="塑型师"
ClassSpecializationSummary="建筑师是机动性强但攻击能力较弱的特工，他们通过强大的尖塔来支援队友。这些不可移动的结构提供了强大的支持效果 - 如果建筑师将它们放置得当。"